
INSERT INTO factory(id,name,address,date_construction,date_addition)
VALUES (1,'Радиозавод','Байдукова 1','1970-05-25','2023-12-12'),
       (2,'Рубин','Байдукова 2','1969-06-01','2023-12-12'),
       (3,'Импульс','Байдукова 3','1970-05-02','2023-12-12'),
       (4,'Алмаз','Байдукова 4','1970-05-03','2023-12-12'),
       (5,'Искра','Байдукова 5','1970-05-04','2023-12-12'),
       (6,'Электроника','Байдукова 6','1970-05-05','2023-12-12');

INSERT INTO device(id,date_release,supervisior,factory_id)
VALUES (1,'2024-01-27','Иванов',1),
       (2,'2024-01-28','Петров',2),
       (3,'2024-01-29','Сидоров',3),
       (4,'2024-01-30','Сидоров',4),
       (5,'2024-01-30','Сидоров',5),
       (6,'2024-01-31','Сидоров',6),
       (7,'2024-02-01','Сидоров',1),
       (8,'2024-02-01','Сидоров',2),
       (9,'2024-02-02','Сидоров',3),
       (10,'2024-02-02','Сидоров',4);

